# CannotCreateDirectShapeRefsWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DirectShapeFailures..::..CannotCreateDirectShapeRefsWarning Property
BuiltInFailures..::..DirectShapeFailures Class See Also
---
Cannot create reference objects for a DirectShape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateDirectShapeRefsWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateDirectShapeRefsWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateDirectShapeRefsWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DirectShapeFailures Class
Autodesk.Revit.DB Namespace